usr.sbin/btrace/btrace.8
.\"	$OpenBSD: btrace.8,v 1.9 2023/09/15 10:56:46 claudio Exp $
.\"
.\" Copyright (c) 2019 Martin Pieuchot <mpi@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: September 15 2023 $
.Dt BTRACE 8
.Os
.Sh NAME
.Nm btrace
.Nd bug tracer
.Sh SYNOPSIS
.Nm btrace
.Op Fl lnv
.Op Fl e Ar program | Ar file
.Op Fl p Ar file
.Op Ar argument ...
.Op Ar command args
.Sh DESCRIPTION
The
.Nm
utility provides an interface to inspect the internals of the system and
programs.
It interprets the
.Xr bt 5
program in
.Ar file
and communicates with the dynamic tracer device using the interface described in
.Xr dt 4 .
.Pp
If a command is provided as the last argument, btrace will execute that
command. This allows for targeted tracing of specific processes for the
duration of their execution.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl e Ar program
Execute
.Ar program .
.It Fl l
List all available probes.
.It Fl n
No action.
Parse the program and then exit.
.It Fl p Ar file
Load symbols from
.Ar file
to convert
.Va ustack
addresses into function names.
.It Fl v
Verbose mode.
Causes
.Nm
to print debugging messages.
Multiple
.Fl v
options increase the verbosity.
The maximum is 2.
.El
.Sh FILES
.Bl -tag -width "/usr/share/btrace/XXXX" -compact
.It Pa /usr/share/btrace/*
collection of useful
.Nm
programs
.El
.Sh EXIT STATUS
.Ex -std 
.Sh SEE ALSO
.Xr dt 4 ,
.Xr bt 5
.Sh HISTORY
The
.Nm
utility first appeared in
.Ox 6.7 .
.Sh AUTHORS
.An Martin Pieuchot Aq Mt mpi@openbsd.org
